<?php
declare(strict_types=1);

use Migrations\AbstractSeed;

/**
 * Links seed.
 */
class LinksSeed extends AbstractSeed
{
    /**
     * Run Method.
     *
     * Write your database seeder using this method.
     *
     * More information on writing seeds is available here:
     * https://book.cakephp.org/phinx/0/en/seeding.html
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'id' => '1',
                'category' => '01',
                'title' => 'リンク先サイト名',
                'url' => '#',
                'description' => 'リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。',
                'search_snippet' => 'ショップ関連 リンク先サイト名 # リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。',
                'created' => '2020-05-01 19:27:31',
                'modified' => '2020-09-30 15:26:49',
                'deleted' => NULL,
            ],
            [
                'id' => '2',
                'category' => '01',
                'title' => 'リンク先サイト名',
                'url' => '#',
                'description' => 'リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。',
                'search_snippet' => 'ショップ関連 リンク先サイト名 # リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。',
                'created' => '2020-05-01 19:27:48',
                'modified' => '2020-09-30 15:26:49',
                'deleted' => NULL,
            ],
            [
                'id' => '3',
                'category' => '01',
                'title' => 'リンク先サイト名',
                'url' => '#',
                'description' => 'リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。',
                'search_snippet' => 'ショップ関連 リンク先サイト名 # リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。',
                'created' => '2020-05-01 19:28:13',
                'modified' => '2020-09-30 15:26:49',
                'deleted' => NULL,
            ],
            [
                'id' => '4',
                'category' => '02',
                'title' => 'リンク先サイト名',
                'url' => '#',
                'description' => 'リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。',
                'search_snippet' => 'その他 リンク先サイト名 # リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。',
                'created' => '2020-05-01 19:28:32',
                'modified' => '2020-09-30 15:26:49',
                'deleted' => NULL,
            ],
            [
                'id' => '5',
                'category' => '02',
                'title' => 'リンク先サイト名',
                'url' => '#',
                'description' => 'リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。',
                'search_snippet' => 'その他 リンク先サイト名 # リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。',
                'created' => '2020-05-01 19:28:43',
                'modified' => '2020-09-30 15:26:49',
                'deleted' => NULL,
            ],
            [
                'id' => '6',
                'category' => '02',
                'title' => 'リンク先サイト名',
                'url' => '#',
                'description' => 'リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。',
                'search_snippet' => 'その他 リンク先サイト名 # リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。リンク先サイトのサンプル解説です。任意の説明文を入れてお使いください。',
                'created' => '2020-05-01 19:28:56',
                'modified' => '2020-09-30 15:26:49',
                'deleted' => NULL,
            ],
        ];

        $table = $this->table('links');
        $table->insert($data)->save();
    }
}
